
#include <iostream>
#include <cstdlib> 
#include <ctime>
#include <cmath>
#include <fstream>
#include <locale>
#include <string>
#include <filesystem>
using namespace std;


//t2
int** Create(size_t n, size_t m)
{
	int** M = new int* [n];
	for (size_t i = 0; i < n; ++i)
	{
		M[i] = new int[m];
	}
	return M;
}
void Free(int** M, size_t n)
{
	for (size_t i = 0; i < n; ++i)
	{
		delete[] M[i];
	}
	delete[] M;
}
void Input(int** M, size_t n, size_t m) {
	for (size_t i = 0; i < n; ++i) {
		for (size_t j = 0; j < m; ++j) {
			cout << "M[" << i << "][" << j << "] = ";
			cin >> M[i][j];
		}
	}
}
void Random(int** x1, const size_t x2, const size_t x3)
{
	srand((unsigned int)time(0));
	for (size_t x = 0; x < x2; x++) {
		for (size_t v = 0; v < x3; v++) {
			x1[x][v] = rand() % 100;
		}
	}
}
void Print(int** M, size_t n, size_t m) {
	for (size_t i = 0; i < n; ++i) {
		for (size_t j = 0; j < m; ++j) {
			std::cout << M[i][j] << ' ';
		}
		std::cout << std::endl;
	}
}


int main()
{
	setlocale(LC_ALL, "rus");
//////////////////////////////////////////////////////////////////////////////////////////////////////////
/*Task 1 - Выделить в памяти динамический одномерный массив типа int.
Размер массива запросить у пользователя.
 Инициализировать его числами степенями двойки : 1, 2, 4, 8, 16, 32, 64, 128 …
Вывести массив на экран. Не забыть освободить память. Разбить программу на функции.*/
 //////////////////////////////////////////////////////////////////////////////////////////////////////////
	cout << "Задание первое:" << endl;

	int* ptrArr;
	int n;
	cout << "Введите размер масива: ";
	cin >> n;
	ptrArr = new int[n];
	int x_two = 1;
	cout << "[Массив] = ";
	for (size_t i = 0; i < n; i++)
	{
		ptrArr[i] = x_two;
		cout << ptrArr[i] << " ";
		x_two *= 2;
	}
	delete[] ptrArr;
	cout << "\n";
//////////////////////////////////////////////////////////////////////////////////////////////////////////
 /*Task 2 - Динамически выделить матрицу 4х4 типа int.
 Инициализировать ее псевдослучайными числами через функцию rand.
 Вывести на экран. Разбейте вашу программу на функции которые вызываются из main.*/
//////////////////////////////////////////////////////////////////////////////////////////////////////////
	{
		cout << "Задание второе: " << "\n";
		size_t n, m;
		std::cout << "Введите количество строк матрицы: ";
		std::cin >> n;
		std::cout << "Введите количество столбцов матрицы: ";
		std::cin >> m;
		int** A = Create(n, m);
		Random(A, n, m);
		Print(A, n, m);
		Free(A, n);
	}
//////////////////////////////////////////////////////////////////////////////////////////////////////////
/*Task 3 - Написать программу, которая создаст два текстовых файла (*.txt),
 примерно по 50-100 символов в каждом (особого значения не имеет с каким именно содержимым).
 Имена файлов запросить у польлзователя.*/
 //////////////////////////////////////////////////////////////////////////////////////////////////////////
	{
		cout << "Задание третье: " << "\n";
		cout << "Первый файл создан! " << "\n";
		string path = "dzSixOne.txt";
		ofstream fout;
		fout.open(path);
		if (!fout.is_open())
		{
			cout << "Ошибка открытия файла!" << endl;
		}
		else
		{
			fout << "Программирование — процесс создания компьютерных программ." << endl;
			fout << "По выражению одного из основателей языков программирования Никлауса Вирта, «Программы = алгоритмы + структуры данных»." << endl;
			fout << "Программирование основывается на использовании языков программирования, на которых записываются исходные тексты программ." << endl;
		}
		fout.close();

		cout << "Второй файл создан! " << "\n";
		string path2 = "dzSixTwo.txt";
		ofstream fout1;
		fout1.open(path2);
		if (!fout1.is_open())
		{
			cout << "Ошибка открытия файла!" << endl;
		}
		else
		{
			fout1 << "С++ – это мультипарадигмальный язык (от слова парадигма – стиль написания компьютерных программ)" << endl;
			fout1 << "Включающий широкий спектр различных стилей и технологий программирования.........................lol" << endl;
		}
		fout1.close();
	}
//////////////////////////////////////////////////////////////////////////////////////////////////////////
/*Task 4 - Написать функцию, «склеивающую» эти файлы в третий текстовый файл
(имя файлов спросить у пользователя).*/
//////////////////////////////////////////////////////////////////////////////////////////////////////////
	{
		cout << "Задание четвёртое: " << "\n";
		ifstream first("dzSixOne.txt");
		ifstream second("dzSixTwo.txt");
		if (!first.is_open() || !second.is_open())
		{
			cout << "Не удалось открыть файл!" << endl;
		}
		ofstream free("dzSixFree.txt");
		for (int i = 0; i < 5; i++)
		{
			char simvol[123];
			second.getline(simvol, 123);
			if (simvol[0] != '\0')
			{
				free << i++ << "\t";
				free << simvol << "\n";
			}
			first.getline(simvol, 123);
			if (simvol[0] != '\0')
			{
				free << i << "\t";
				free << simvol << endl;
			}
		}
		free.close();
		cout << "Файл готов!" << endl;
	}
//////////////////////////////////////////////////////////////////////////////////////////////////////////
 /*Task 5 - Написать программу, которая проверяет присутствует ли указанное пользователем
при запуске программы слово в указанном пользователем файле (для простоты работаем только с латиницей).
Используем функцию find которая есть в строках std::string.*/
//////////////////////////////////////////////////////////////////////////////////////////////////////////

	{
		cout << "Задание пятое: " << "\n";
		string Stroka;
		ifstream free("dzSixFree.txt");
		bool app = false;
		string a;
		cout << "Введите слово которое хотите найти: ";
		cin >> a;
		while (!free.eof())
		{
			getline(free, Stroka);

			if (Stroka.find(a) != string::npos) 
			{
				app = true;
			}		
		}   		
		  if (app) 
		  {
			cout << a << " обнаружен в файле!";
		  }
		else
		{
			cout << "Мы не нашли вашего " << a;
		} 
		  free.close();
    }
	return 0;
}





